// # theBreadMethod

const { fstat } = require("fs")

// A Tabulation of BREAD Conversion Methods

// For the Modern Influencer
  // 2021

// Jeffrey Thomas Bodin
  // github.com/JeffreyBodin

// Use in "Sponsor tiers"
  // github.com/sponsors/[ YOU ]/dashboard/tiers

-----------------------
Tier (1) 
- USD -> $1
-----------------------

Tier -> 🍞 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (2) 
- USD -> $5
-----------------------

Tier -> 🥐🥐🍞 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (3) 
- USD -> $7
-----------------------

Tier -> 🥖🥐🍞 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (4) 
- USD -> $10
-----------------------

Tier -> 🥪🥐 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (5) 
- USD -> $13
-----------------------

Tier -> 🥪🥖🍞 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (6) 
- USD -> $16
-----------------------

Tier -> 🥪🥪 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (7) 
- USD -> $24
-----------------------

Tier -> 🥪🥪🥪 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (8) 
- USD -> $32
-----------------------

Tier -> 🥪🥪🥪🥪 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (9) 
- USD -> $64
-----------------------

Tier -> 🥪🥪🥪🥪🥪🥪🥪🥪 Tier

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----

-----------------------
Tier (10) 
- USD -> $1337
-----------------------

Tier -> ☑🐂 Tier

🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪

🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪

🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪

🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪
🥪🥪🥪🥪🥪🥪🥪🥪

-----

| ♻ Table   |
| 🍞 -> 🍞 |

  🍞 = 🍞

  🥐 = 🍞🍞

  🥖 = 🥐🥐

  🥪 = 🥖🥖

  ☑🐂 = 

  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
  🥪🥪🥪🥪🥪🥪🥪🥪
    
  ✖
    
  5️⃣

-----


// # LICENSE

/*
  ```js
  MIT License
  
  Copyright (c) 2021 Jeffrey Bodin
  ```
  
  ```js
  MIT License

  Copyright (c) 2021 Jeffrey Bodin

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in all
  copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
  SOFTWARE.
  ```
*/



// return console.log(this.__filename('2021-01-31 JeffreyBodin - BREAD TO BREAD - tabulationAlgoForModernInfluencers.js'));

//var fs = fs['2021-01-31 JeffreyBodin - BREAD TO BREAD - tabulationAlgoForModernInfluencers.js'];
//return console.log([fs]);

return console.log('2021-01-31 JeffreyBodin - BREAD TO BREAD - tabulationAlgoForModernInfluencers.js');
